In [1]:
import numpy as np
import pandas as pd

In [2]:
dataset = pd.read_csv('Data.csv') # need a Data set

In [3]:
dataset

   Country  Age   Salary Purchased
0   France   44  72000.0        No
1    Spain   55  48000.0       Yes
2  Germany   30      NaN        No
3    Spain   66  61000.0        No
4  Germany   40      NaN       Yes
5   France   35  58000.0       Yes
6    Spain   55  52000.0        No
7   France   48  79000.0       Yes
8  Germany   50  83000.0        No
9   France   37  67000.0       Yes

In [4]:
x = dataset.iloc[:,:-1].values
y = dataset.iloc[:,-1].values

In [5]:
x

array([['France', 44, 72000.0],
       ['Spain', 55, 48000.0],
       ['Germany', 30, nan],
       ['Spain', 66, 61000.0],
       ['Germany', 40, nan],
       ['France', 35, 58000.0],
       ['Spain', 55, 52000.0],
       ['France', 48, 79000.0],
       ['Germany', 50, 83000.0],
       ['France', 37, 67000.0]], dtype=object)

In [6]:
y

array(['No', 'Yes', 'No', 'No', 'Yes', 'Yes', 'No', 'Yes', 'No', 'Yes'],
      dtype=object)

In [7]:
dataset.isnull().sum()

Country      0
Age          0
Salary       2
Purchased    0
dtype: int64

In [8]:
from sklearn.impute import SimpleImputer

In [9]:
imputer = SimpleImputer(missing_values=np.nan,strategy='mean')

In [10]:
imputer.fit(x[:,1:3])

SimpleImputer()

In [11]:
x[:,1:3] = imputer.transform(x[:,1:3])

In [12]:
print(x)

[['France' 44.0 72000.0]
 ['Spain' 55.0 48000.0]
 ['Germany' 30.0 65000.0]
 ['Spain' 66.0 61000.0]
 ['Germany' 40.0 65000.0]
 ['France' 35.0 58000.0]
 ['Spain' 55.0 52000.0]
 ['France' 48.0 79000.0]
 ['Germany' 50.0 83000.0]
 ['France' 37.0 67000.0]]

# Encoder

In [13]:
import pandas as pd

In [14]:
from sklearn.preprocessing import LabelEncoder

In [15]:
salary_class = pd.DataFrame({'salary':[5000,84000,22000,8000,75000],
                       'class':['low','High','medium','low','high']})

In [16]:
print(salary_class)

   salary   class
0    5000     low
1   84000    High
2   22000  medium
3    8000     low
4   75000    high

In [17]:
lab_encode = LabelEncoder()

In [18]:
salary_class['class'] = lab_encode.fit_transform(salary_class['class'])

In [19]:
salary_class

   salary  class
0    5000      2
1   84000      0
2   22000      3
3    8000      2
4   75000      1

# Ordinal Encoder

In [20]:
salary_class1 = pd.DataFrame({'salary':[5000,84000,22000,8000,75000],
                       'Class':['low','High','medium','low','high']})

In [21]:
salary_class1

   salary   Class
0    5000     low
1   84000    High
2   22000  medium
3    8000     low
4   75000    high

In [22]:
salary_class1.Class.unique()

array(['low', 'High', 'medium', 'high'], dtype=object)

In [23]:
order = ['low', 'High', 'medium', 'high']

In [24]:
order

['low', 'High', 'medium', 'high']

In [25]:
from sklearn.preprocessing import OrdinalEncoder

In [26]:
ord_enc = OrdinalEncoder(categories=[order])

In [27]:
ord_enc

OrdinalEncoder(categories=[['low', 'High', 'medium', 'high']])

In [28]:
ord_enc.fit(salary_class1[['Class']])

OrdinalEncoder(categories=[['low', 'High', 'medium', 'high']])

In [29]:
salary_class1['Class'] = ord_enc.transform(salary_class1[['Class']])

In [30]:
print(salary_class1)

   salary  Class
0    5000    0.0
1   84000    1.0
2   22000    2.0
3    8000    0.0
4   75000    3.0